src/Documents/ЗакрытиеСтанции/ЗакрытиеСтанции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСтанции</name>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>ТоварНаСтанции</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияПеремещения</name>
      <type>
        <types>CatalogRef.Станции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПеремещениеТовара/ПеремещениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТовара</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ЗакрытиеСтанции/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтанция = Станция.ПолучитьОбъект();
	ТекСтанция.Статус = Основание;
	ТекСтанция.Записать();
	
	Для Каждого Позиция Из ТоварыДляПеремещения Цикл
		Перемещение = Документы.ПеремещениеТовара.СоздатьДокумент();
		Перемещение.Дата = Дата;
		Перемещение.Станция = Позиция.СтанцияПеремещения;
		Перемещение.Товар = Позиция.ТоварНаСтанции;
		Перемещение.Инициатор = ПользователиВызовСервера.ТекущийСотрудник();
		Перемещение.Записать();
	КонецЦикла;
КонецПроцедуры
